//코드의 시작점
void main() {
  //데이터란?
  //사물이나 현상에서 얻어진 사실 또는 값을 의미한다.

  // 변수란?
  //값을 저장할 수 있는 메모리 공간, 즉 값을 저장해 놓고 이후에 재사용 하거나
  //변경할 수 있도록 메모리 공간을 이름으로 할당한 개념을 말한다

  //데이터 타입이란?
  //메모리 공간에 들어간 값의 형태이다.

  int n1 = 10;
  double d1 = 10.0;
  bool b1 = true;
  String s1 = "홍길동";
  String s2 = '홍홍홍'; //홀따옴표 권장사항

  // dart  기본 메모리 공간 3가지
  // 스택(stack) LIFO (후입선출)  - 지역변수, 매개변수 저장,
  // 힙영역 (heap)  - new / 리터럴(오른쪽의 값들 Rvalue쪽 값들 )
  // 객체는 동적으로 사이즈가 늘었다가 줄었다가 하기때문에 동적 메모리 공간인 new. 리터럴 선언
  // 정적영역(static) - 전역변수, 클래스의 static  변수, 컴파일 시점 상수 등

//
}
